src/cf/Documents/ExpenseByLimits.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ExpenseByLimits</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.TurnoverByEmployeeLimits</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoIndividuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Entity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LimitsForEmployees</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>TypeOfLimit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.TypesOfLimitsForEmployees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Stage</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.StageOfLimitsForEmployees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Limit</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/_DemoCompaniesEmployees.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_DemoCompaniesEmployees</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Department_Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoDepartments</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OccupiedRates</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>EmployeeCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Organization</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Individual</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoIndividuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/EmploymentContract.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>EmploymentContract</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.EmployeeLimitPlaning</xr:Item>
				<xr:Item>InformationRegister._DemoCompaniesEmployees</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoIndividuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoDepartments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndContractDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Entity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Period</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmployeeCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LimitsForEmployees</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>TypeOfLimit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.TypesOfLimitsForEmployees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LimitDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LimitDateEnd</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Stage</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.StageOfLimitsForEmployees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StageDescription</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Limit</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Count</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NotApplicable</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/TypesOfLimitsForEmployees.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>TypesOfLimitsForEmployees</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AmountLimitControl</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CountLimitControl</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckLimitControl</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CloseUponDismissal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpenseItem</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OneTime</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashFlowItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/ExpenseByLimits/Forms/DocumentForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS
 
#Region EventHandlers

&AtServer
Procedure OnReadAtServer(CurrentObject)

	EmploymentContract = GetEmploymentContractForEmployee(CurrentObject);
	EntityBeforeChange = CurrentObject.Entity;

	FillAdditionalColumns();

EndProcedure // OnReadAtServer()

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)

	LimitsForEmployeesServer.OnCreateAtServer(ThisObject, Cancel, StandardProcessing);

	// StandardSubsystems.AttachableCommands
	AttachableCommands.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AttachableCommands

	// StandardSubsystems.SourceDocumentsOriginalsRecording
	SourceDocumentsOriginalsRecording.OnCreateAtServerDocumentForm(ThisObject);
	// End StandardSubsystems.SourceDocumentsOriginalsRecording

	If NOT ValueIsFilled(Object.Date) Then
		Object.Date = CurrentSessionDate();
	EndIf;

	SetConditionalAppearance();
	SetChoiceParameters();

EndProcedure

&AtClient
Procedure OnOpen(Cancel)

	IsNewRow = False;

EndProcedure

#EndRegion // EventHandlers

////////////////////////////////////////////////////////////////////////////////
// ITEM EVENT HANDLERS

#Region ItemEventHandlers

#Region Header

&AtClient
Procedure EntityOnChange(Item)

	If EntityBeforeChange <> Object.Entity Then

		Object.Number = "";

		EmployeeOnChangeAtServer();
	EndIf;

	EntityBeforeChange = Object.Entity;

EndProcedure // EntityOnChange()

&AtClient
Procedure EmployeeOnChange(Item)

	EmployeeOnChangeAtServer();

EndProcedure

#EndRegion // Header

#Region TableLimitsForEmployees

&AtClient
Procedure LimitsForEmployeesOnActivateRow(Item)

	SetEditFormatLimit();

EndProcedure

&AtClient
Procedure LimitsForEmployeesTypeOfLimitOnChange(Item)

	FillAdditionalColumns(Items.LimitsForEmployees.CurrentRow);

	SetEditFormatLimit();

EndProcedure

#EndRegion // TableLimitsForEmployees

#EndRegion // ItemEventHandlers

////////////////////////////////////////////////////////////////////////////////
// PRIVATE

#Region Private

&AtServer
Procedure FillAdditionalColumns(CurrentRowID = Undefined)

	If CurrentRowID = Undefined Then
		arrLimitForEmployee = Object.LimitsForEmployees;
		mapAttribute = Common.ObjectsAttributesValues(Object.LimitsForEmployees.Unload().UnloadColumn("TypeOfLimit"), "AmountLimitControl, CountLimitControl, OneTime");
	Else
		CurrentRow = Object.LimitsForEmployees.FindByID(CurrentRowID);

		arrLimitForEmployee = New Array;
		arrLimitForEmployee.Add(CurrentRow);

		mapAttribute = New Map;
		mapAttribute.Insert(CurrentRow.TypeOfLimit, Common.ObjectAttributesValues(CurrentRow.TypeOfLimit, "AmountLimitControl, CountLimitControl, OneTime"));
	EndIf;

	For Each CurrentRow In arrLimitForEmployee Do

		CurrentRow.OneTime = mapAttribute[CurrentRow.TypeOfLimit].OneTime;

		If CurrentRow.OneTime Then
			CurrentRow.Stage = Undefined; 
		EndIf;

		If mapAttribute[CurrentRow.TypeOfLimit].CountLimitControl Then
			CurrentRow.ResourceType = 1;
		Else
			CurrentRow.ResourceType = 0;
		EndIf;
	EndDo;

EndProcedure

&AtClient
Procedure SetEditFormatLimit()

	CurrentData = Items.LimitsForEmployees.CurrentData;

	If CurrentData = Undefined Then
		Return;
	EndIf;

	If CurrentData.ResourceType = 1 Then
		Items.LimitsForEmployeesLimit.EditFormat = "NFD=0";
	Else
		Items.LimitsForEmployeesLimit.EditFormat = "ND=15; NFD=2";
	EndIf;

EndProcedure

&AtServer
Procedure EmployeeOnChangeAtServer()

	NewEmploymentContract = GetEmploymentContractForEmployee();
	If EmploymentContract <> NewEmploymentContract Then
		
		For Each LimitsForEmployeesRow In Object.LimitsForEmployees Do
			LimitsForEmployeesRow.Stage = Undefined;
		EndDo;

		EmploymentContract = NewEmploymentContract;
	EndIf;
		
EndProcedure

&AtServer
Function GetEmploymentContractForEmployee(CurrentObject = Undefined)

	If CurrentObject = Undefined Then
		CurrentObject =  Object;
	EndIf;

	Query = New Query;
	Query.Text =
	"SELECT
	|	EmployeesSliceFirst.EmploymentContract AS EmploymentContract
	|FROM
	|	InformationRegister._DemoCompaniesEmployees.SliceFirst(
	|			,
	|			Individual = &Employee
	|				AND Organization = &Entity) AS EmployeesSliceFirst";

	Query.SetParameter("Employee", CurrentObject.Employee);
	Query.SetParameter("Entity", CurrentObject.Entity);

	Selection = Query.Execute().Select();
	If Selection.Next() Then
		NewEmploymentContract = Selection.EmploymentContract;
	Else 
		NewEmploymentContract = Documents.EmploymentContract.EmptyRef();
	EndIf;

	Return NewEmploymentContract;

EndFunction

&AtServer
Procedure SetChoiceParameters()

	Query = New Query;
	Query.Text =
	"SELECT
	|	TypesOfLimitsForEmployees.Ref AS Ref
	|FROM
	|	Catalog.TypesOfLimitsForEmployees AS TypesOfLimitsForEmployees
	|WHERE
	|	(TypesOfLimitsForEmployees.CountLimitControl
	|			OR TypesOfLimitsForEmployees.AmountLimitControl)
	|	AND NOT TypesOfLimitsForEmployees.DeletionMark";

	arrTypeOfLimit = Query.Execute().Unload().UnloadColumn("Ref");

	arrChoiceParameters = New Array;
	arrChoiceParameters.Add(New ChoiceParameter("Filter.Ref", arrTypeOfLimit));

	Items.LimitsForEmployeesTypeOfLimit.ChoiceParameters = New FixedArray(arrChoiceParameters);

EndProcedure

&AtServer
Procedure SetConditionalAppearance()

	AppearanceItemsTemplate = ConditionalAppearanceServer.AppearanceItemsTemplate();

	///////////////////////////////////////////////////////////////////////////////////
	// Stage - ReadOnly
	ConditionalAppearanceItem = ConditionalAppearance.Items.Add();

	// ## Appearance
	AppearanceItems = New Structure(AppearanceItemsTemplate);
	AppearanceItems.ReadOnly = True;

	ConditionalAppearanceServer.SetAppearanceItems(ConditionalAppearanceItem, AppearanceItems); 	

	// ## Items
	ConditionalAppearanceServer.AddFormItem(ConditionalAppearanceItem, Items.LimitsForEmployeesStage);

	// ## Filter
	CommonClientServer.SetFilterItem(ConditionalAppearanceItem.Filter, "Object.LimitsForEmployees.OneTime", True); 

	///////////////////////////////////////////////////////////////////////////////////
	// Stage - MarkIncomplete
	ConditionalAppearanceItem = ConditionalAppearance.Items.Add();

	// ## Appearance
	AppearanceItems = New Structure(AppearanceItemsTemplate);
	AppearanceItems.MarkIncomplete = True;

	ConditionalAppearanceServer.SetAppearanceItems(ConditionalAppearanceItem, AppearanceItems); 	

	// ## Items
	ConditionalAppearanceServer.AddFormItem(ConditionalAppearanceItem, Items.LimitsForEmployeesStage);

	// ## Filter
	CommonClientServer.SetFilterItem(ConditionalAppearanceItem.Filter, "Object.LimitsForEmployees.OneTime", False); 
	CommonClientServer.SetFilterItem(ConditionalAppearanceItem.Filter, "Object.LimitsForEmployees.Stage",, DataCompositionComparisonType.NotFilled); 

	///////////////////////////////////////////////////////////////////////////////////
	// Format limit - Count
	ConditionalAppearanceItem = ConditionalAppearance.Items.Add();

	// ## Appearance
	AppearanceItems = New Structure(AppearanceItemsTemplate);
	AppearanceItems.Format = "NFD=0";

	ConditionalAppearanceServer.SetAppearanceItems(ConditionalAppearanceItem, AppearanceItems); 	

	// ## Items	
	ConditionalAppearanceServer.AddFormItem(ConditionalAppearanceItem, Items.LimitsForEmployeesLimit);

	// ## Filter
	CommonClientServer.SetFilterItem(ConditionalAppearanceItem.Filter, "Object.LimitsForEmployees.ResourceType", 1); 

	///////////////////////////////////////////////////////////////////////////////////
	// Format limit	- Amount
	ConditionalAppearanceItem = ConditionalAppearance.Items.Add();

	// ## Appearance
	AppearanceItems = New Structure(AppearanceItemsTemplate);
	AppearanceItems.Format = "ND=15; NFD=2";

	ConditionalAppearanceServer.SetAppearanceItems(ConditionalAppearanceItem, AppearanceItems); 	

	// ## Items	
	ConditionalAppearanceServer.AddFormItem(ConditionalAppearanceItem, Items.LimitsForEmployeesLimit);

	// ## Filter
	CommonClientServer.SetFilterItem(ConditionalAppearanceItem.Filter, "Object.LimitsForEmployees.ResourceType", 0);

EndProcedure 

// StandardSubsystems.AttachableCommands
&AtClient
Procedure Attachable_ExecuteCommand(Command)
	AttachableCommandsClient.StartCommandExecution(ThisObject, Command, Object);
EndProcedure

&AtClient
Procedure Attachable_ContinueCommandExecutionAtServer(ExecutionParameters, AdditionalParameters) Export
	ExecuteCommandAtServer(ExecutionParameters);
EndProcedure

&AtServer
Procedure ExecuteCommandAtServer(ExecutionParameters)
	AttachableCommands.ExecuteCommand(ThisObject, ExecutionParameters, Object);
EndProcedure

&AtClient
Procedure Attachable_UpdateCommands()
	AttachableCommandsClientServer.UpdateCommands(ThisObject, Object);
EndProcedure
// End StandardSubsystems.AttachableCommands

#EndRegion // Private
